# -*- mode:org; fill-column:79; -*-

#+title:Introduction to NodeJS
#+subtitle:Microsoft DEV283x
#+subtitle: {{{version}}} {{{date}}}
#+date:2019-06-24 16:21
#+macro:version Version 0.0.3

{{{version}}} {{{date}}}

*** Before We Start
#+cindex:node version
Let's check that you have everything ready to get up and running with the
exercises and code presented in this course.  Open your Terminal app or Command
Prompt and type the following commands to check for the presence and versions
of the required platforms, tools and libraries.

{{{heading(Node version check)}}}

Node must be v8 or higher.  Check it by running:

#+name:node-version-check
#+begin_src sh :results output :exports results
node --version
#+end_src

#+RESULTS: node-version-check
: v12.4.0

{{{heading(Execute Node statement)}}}

#+cindex:node, execute
You should be able to execute Node. You can use ~-e~ to quickly run Node code,
for example:

#+name:node-execute-check
#+begin_src sh :results output :exports results
node -e 'console.log(`My node version is ${process.versions.node}`)'
#+end_src

#+RESULTS: node-execute-check
: My node version is 12.4.0

{{{heading(npm version check)}}}

#+cindex:npm version
~npm~ must be v5 or higher.  Check it by running:

#+name:npm-version-check
#+begin_src sh :results output :exports results
npm --version
yarn --version
#+end_src

#+RESULTS: npm-version-check
: 6.9.0
: 1.17.0

{{{heading(npm installation check)}}}

#+cindex:npm global installation
#+cindex:yarn global intallation
Let's test ~npm~ installation.  Go ahead and globally install ~node-static~
which is a useful local development web server:

#+name:npm-global-installation-check
#+begin_src sh :results output :exports results
yarn global add node-static
#+end_src

#+RESULTS: npm-global-installation-check
: yarn global v1.17.0
: [1/4] Resolving packages...
: [2/4] Fetching packages...
: [3/4] Linking dependencies...
: [4/4] Building fresh packages...
: success Installed "node-static@0.7.11" with binaries:
:       - static
: Done in 8.20s.

You should not see any errors or need sudo if you followed instructions on how
to change ownership of npm in the previous unit.  If you see permission errors,
then please go back to configuring ~npm~ and change the ownership of ~npm~'s
folder.

{{{heading(node-static version check)}}}

When ~node-static~ is done installing, then you should be able to check
~static~ (command for node-static) with (I'm using 0.7.9):

#+name:node-static-version-check
#+begin_src sh :results output :exports results
static --version
#+end_src

#+RESULTS: node-static-version-check
: node-static 0.7.9

{{{heading(MongoDB version check)}}}

MongoDB must be v3 or higher:

#+name:mongodb-version-check
#+begin_src sh :results output :exports results
mongod --version
#+end_src

#+RESULTS: mongodb-version-check
: db version v4.0.10
: git version: c389e7f69f637f7a1ac3cc9fae843b635f20b766
: allocator: system
: modules: none
: build environment:
:     distarch: x86_64
:     target_arch: x86_64
**** Eval Option
#+cindex:eval @option{-e}
If all we need is a quick set of statements, there’s a eval ~-e~ option that
allows us to run inline JavaScript/Node.js.  For example, to print the current
date, run this in your Terminal / Command Prompt:

#+begin_src sh :results output :exports results
node -e "console.log(new Date())"
#+end_src

#+RESULTS:
: 2019-06-24T23:20:25.181Z

